/* ?animal */
Template.add('animal', () =>
	{T.trResult = either(
		"꿀벌",
		"코끼리",
		"토끼",
		"문어",
		"침팬지",
		"오징어",
		"연체동물",
		"원숭이",
		"말벌",
		"개코원숭이",
		"늑대",
		"곰",
		"엘크",
		"물개",
		"돌고래",
		"고래",
		"해파리",
		"고양이",
		"사자",
		"호랑이",
		"치타",
		"들개",
		"흑표범",
		"두더지",
		"오소리",
		"라텔",
		"오리",
		"거위",
		"참새",
		"울새",
		"농어",
		"강꼬치고기",
		"연어",
		"철갑상어",
		"개구리",
		"도룡뇽들의",
		"악어",
		"두꺼비",
		"매",
		"독수리",
		"갑오징어",
		"비단뱀",
		"아나콘다",
		"살무사",
		"코브라",
		"철갑상어",
		"송어",
		"연어",
		"참치",
		"사슴",
		"굴"
	); getPostNum(T.trResult); return T.trResult;}
);

/* ?animals */
Template.add("animals", () =>
	{T.trResult = either(
		"꿀벌들",
		"코끼리들",
		"토끼들",
		"문어들",
		"침팬지들",
		"오징어들",
		"연체동물들",
		"원숭이들",
		"말벌들",
		"개코원숭이들",
		"늑대들",
		"곰들",
		"엘크들",
		"물개들",
		"돌고래들",
		"고래들",
		"해파리들",
		"고양이들",
		"사자들",
		"호랑이들",
		"치타들",
		"들개들",
		"흑표범들",
		"두더지들",
		"오소리들",
		"라텔들",
		"오리들",
		"거위들",
		"참새들",
		"울새들",
		"농어들",
		"강꼬치고기들",
		"연어들",
		"철갑상어들",
		"개구리들",
		"도룡뇽들의들",
		"악어들",
		"두꺼비들",
		"매들",
		"독수리들",
		"갑오징어들",
		"비단뱀들",
		"아나콘다들",
		"살무사들",
		"코브라들",
		"철갑상어들",
		"송어들",
		"연어들",
		"참치들",
		"사슴들",
		"굴들"
	); getPostNum(T.trResult); return T.trResult;}
);

/* ?garden */
Template.add("garden", () => either("꽃들을 잘라낸다", "나무들을 잘라낸다", "덤불들을 잘라낸다", "꽃들에게 물을 준다", "잡초들을 제거한다"));

/* ?admires */
Template.add("admires", () => either("음흉하게 쳐다본다", "감상한다", "훑어본다", "유심히 쳐다본다"));

/* ?gwylanItem */
Template.add("gwylanItem", () =>
	{T.trResult = either(
		"트로피",
		"야구공",
		"야구 방망이",
		"스노우 글로브",
		"마법의 8번 당구공",
		"탁구채",
		"체스 세트",
		"돼지저금통",
		"머그컵",
		"쿠키 상자",
		"프라이팬",
		"효자손",
		"연필통",
		"도시락 상자",
		"용암 램프",
		"손전등",
		"뻐꾸기 시계",
		"루빅스 큐브",
		"지구본",
		"물총",
		"사전",
		"손거울",
		"싸구려 카메라",
		"조개껍데기가 꽉찬 집락 비닐백",
		"작은 발판사다리",
		"윤활액 병",
		"어디 쓰이는지 모를 골동품"
	); getPostNum(T.trResult); return T.trResult;}
);

/* ?sin */
Template.add("sin", () => {T.trResult = either("오만", "분노", "질투", "음욕", "탐욕", "인색", "나태"); getPostNum(T.trResult); return T.trResult;});

/* ?chatter1 */
Template.add("chatter1",() => 
	either(
		"잘 생각해보면, 사실 우리 둘 다 여기에 없는 거야.",

		"야야, 들어 봐. 그 소문 들었냐? 그거 아무것도 아냐.",

		"직접 해보기 전까진 함부로 판단하면 안돼. 재즈 메탈은 통한다고.",

		"윈터 선생님은 사실 정말 멋져, 화석적인 면에서 말이지만.",

		"솔직히 말해서, 늑대한테는 대줄 수 있을 것 같아.",

		"퀴즈(quiz)가 당혹스러우면(quizzical), 시험(test)은 뭐겠어? (testicle = 고환임을 이용한 말장난)",

		"너. 나. 저 책장. 도서관 피구. 같이 할래?",

		"I나는 이 학교에서 재활용 쓰레기통을 본 적이 한 번도 없어. 믿을 수가 없네.",

		"우리 학교 식당 음식이 꽤 괜찮더라. 내 소소한 낙이야.",

		"아, 세상의 비애를 모르는 애벌레가 될 수 있다면, 얼마나 좋을까.", 

		"누가 오징어처럼, 마치, 촉수 같은 것이 달린 고래를 봤다고 하더라고. 오징어랑 고래가 마침내 그들의 차이를 이겨내고 같이 한 판 떴다고 생각해?"
	)
);

/* ?chatter2 */
Template.add("chatter2",() => 
	either(
		"왜 내가 너같은 애랑 친구먹고 있는 걸까?",

		"나한테 아는 척 하지 말라고 했잖아.",

		"뭔 개소리야?",

		"난 여기서 나가야겠어.",

		"우리 한번만이라도 정상적인 대화를 하면 안될까?",

		"...뭐?",

		"술취한 채로 학교에 오면 안 되지.",

		"I경찰 부른다.",

		"접근금지 신청을 해야겠어. 이번엔, 진짜로.",

		"너 좀 어디에 처박아두면 안되냐?",
		
		"나무처럼 가만히 있다가 겨울에는 좀 죽어주면 안되겠냐?"
	)
);
