setup.shopDetails = {
	normal: {
		name: "일반",
		desc: "일상생활에 적합하다.",
		details: "none",
	},
	formal: {
		name: "격식",
		desc: "중요한 행사나, 특정한 동반자들 사이에서 좋은 예의를 보이기 적합하다.",
		details: "특정 행사나 화려한 데이트를 할 때 필요한 복장이다.",
	},
	school: {
		name: "학교",
		desc: "지역 학교에서 허가된 교복.",
		details: "수업을 듣기 위해서는 교복 상의와 하의를 필요로 한다. 추가로 학교 특성의 옷을 입으면 불량도를 조금 낮춰준다.",
	},
	glasses: {
		name: "안경",
		desc: "당신이 집중하는 것을 돕는다.",
		details: "학교 성적이 오르는 속도를 높여준다.",
	},
	cool: {
		name: "유행",
		desc: "당신을 더 인기 있게 해 주지만, 일부 교사가 싫어할 수 있다.",
		details: "학교 친구들에게서의 평가가 향상되는 속도를 높여준다. 탐탁찮아 하는 선생들에게서 부정적인 이벤트가 발생할 수 있다.",
	},
	swim: {
		name: "수영복",
		desc: "물속에서 편하게 있을 수 있다.",
		details: "수영 기술의 성공률을 높여준다. 수분이 옷에서 새어나오는 것을 막아준다.",
	},
	diving: {
		name: "잠수복",
		desc: "물속에서도 몸을 따뜻하게 유지해준다.",
		details: "차가운 물속에서 수영할 때 스트레스가 올라가는 것을 막아준다.",
	},
	dance: {
		name: "댄스복",
		desc: "댄스플로어의 혹독함을 견딜 수 있을 정도로 유연하다.",
		details: "춤 출 때 댄스복이 아니면 상할 수 있지만, 댄스복은 찢어지지 않는다.",
	},
	costume: {
		name: "코스튬",
		desc: "주변 상황과 다른 때에 입으면, 사람들은 이상한 눈으로 볼 지도 모른다.",
		details: "특정 이벤트에서 고유의 대사를 발동시킨다.",
	},
	serving: {
		name: "서빙",
		desc: "바텐더, 웨이터, 혹은 웨이트리스로 일할 때 보이도록 입으면 팁을 더 받을 수 있다.",
		details: "이 특성이 있는 아이템당 팁을 20%씩 더 받을 수 있다.",
	},
	fetish: {
		name: "페티쉬",
		desc: "본질적으로 선정적이다.",
		details: "최소 흥분도를 높여준다.",
	},
	sleep: {
		name: "잠옷",
		desc: "부드럽고 아늑하다. 수면의 질을 높인다.",
		details: "수면중 피로도를 추가로 낮춰준다. 잠옷, 속옷, 그리고 으스스한 아이템이 아닌 옷을 입고 자면 이 효과가 무효화된다.",
	},
	mask: {
		name: "마스크",
		desc: "당신의 정체성을 숨기고, 명성이 오르는걸 막는다. 경찰이나 당신을 아는 사람을 속일 수는 없을 것이다.",
		details: "긍정적인 것이든 부정적인 것이든, 명성이 오르는 것을 막아준다.",
	},
	holy: {
		name: "신성함",
		desc: "지역 신앙에서 신성시된다.",
		details: "순결도의 변동량이 증가한다.",
	},
	dark: {
		name: "불경함",
		desc: "지역 신앙에서 불경한 것으로 여겨진다.",
		details: "성지식의 변동량이 증가한다.",
	},
	binding: {
		name: "구속",
		desc: "당신의 팔을 단단하게 구속하고 무력하게 만든다.",
		details: "당신의 팔을 사용하지 못하게 한다.",
	},
	stealthy: {
		name: "은밀함",
		desc: "당신의 범죄를 추적하기 어렵게 만든다.",
		details: "도둑질에서 얻는 범죄의 양을 줄여준다.",
	},
	sticky_fingers: {
		name: "끈적한 손가락",
		desc: "원하는 것을 더 쉽게 얻을 수 있고, 당신의 것이 아닌 것을 가질 수 있다.",
		details: "속임수 기술의 성공률을 올려준다.",
	},
	rainproof: {
		name: "생활방수",
		desc: "당신을 비로부터 보호한다.",
		details: "옷이 비나 눈으로 젖지 않게 막아준다.",
	},
	bimbo: {
		name: "스페셜",
		desc: "이 옷 종류는 뭔가 특별한 것 같다.",
		details: `당신의 몸을 여성스럽게 만들어, 가슴과 엉덩이 크기를 키워주고, 자지 크기를 줄여준다. "강한 욕망" 특성의 진행도를 올린다.`,
	},
	himbo: {
		name: "스페셜",
		desc: "당신을 비로부터 보호한다.",
		details: `당신의 몸을 남성스럽게 만들어, 가슴과 엉덩이 크기를 줄여주고, 자지 크기를 키워준다. "강한 욕망" 특성의 진행도를 올린다.`,
	},
	heels: {
		name: "높은 굽",
		desc: "발놀림이 숙달되지 않았다면, 돌아다니기 어렵다.",
		details:
			"전투중 발차기 효과를 높여준다. 이동 속도를 줄여준다. 피로도를 높여주거나 농장지대, 황무지, 숲에서 운동 기술의 성공률을 낮춰준다.",
	},
	rugged: {
		name: "튼튼함",
		desc: "거친 환경에서 발디딤을 도와준다.",
		details: "농장지대, 황무지, 숲에서 운동 기술의 성공률을 높여준다.",
	},
	chest_bind: {
		name: "가슴 감음",
		desc: "가슴을 꽉 조여서, 당신의 가슴을 숨긴다.",
		details: `당신의 겉보기 가슴 크기를 줄여준다. "평범한" 이상의 가슴 크기는 완벽히 평평해 보이게 할 수 없으며, 대신 겉보기 크기를 다섯 단계 줄여준다.`,
	},
	eerie: {
		name: "으스스함",
		get desc() {
			return V.transformdisable === "f"
				? "특정 변신을 막는다. 변신 진행도는 자정에 진행되거나 쇠퇴한다."
				: "이 물건엔 무언가 이상한 점이 있다.";
		},
		get details() {
			return V.transformdisable === "f" ? "해당되는 변신 진행도가 떨어지는 것을 막아준다." : "이 특성을 사용가능하게 하려면 변신 기능을 활성화하여야 한다.";
		},
	},
	shade: {
		name: "햇빛 가리개",
		desc: "태양을 가린다.",
		details: "간접적으로 피부가 타는 것을 막아준다.",
	},
	asylum: {
		name: "정신병원",
		desc: "지역 정신병원의 복장이다.",
		details: "none",
	},
	prison: {
		name: "교도소",
		desc: "지역 교도소의 복장이다.",
		details: "none",
	},
	sticky: {
		name: "달라붙음",
		desc: "당신의 피부에 달라붙는다.",
		details: "전투중 쉽게 벗겨지지 않는다.",
	},
	"strap-on": {
		name: "페니스 밴드",
		desc: "당신의 허리에 딱 맞는다.",
		details: "다른 사람에게 삽입할 때 사용할 수 있다.",
	},
	covered: {
		name: "가려줌",
		desc: "몸의 여러 부위를 보호해 준다.",
		details:
			"가려진 피부에는 낙서를 당하지 않는다. 이 특성이 있는 얼굴 악세사리는 키스, 삽입, 혀 공격에서 입을 보호해준다. 이 특성이 있는 속옷은 노출되었을 때 음란하지 않은 것으로 여겨진다. 이 특성이 있는 하의는 당신의 상체를 절반 가려주어, 상의를 입지 않아도 되도록 해 준다.",
	},
	naked: {
		name: "노출",
		desc: "너무 노출이 심해서, 옷을 입지 않은 것과 다를 바가 없다.",
		details: "모든 것을 노출시켜 준다.",
	},
	athletic: {
		name: "운동복",
		desc: "스포티하다.",
		details: "운동 기술의 증가속도를 높여준다.",
	},
	riding: {
		name: "승마복",
		desc: "승마에 적합하다.",
		details: "승마 레슨에서 허벅지 기술의 증가속도를 높여준다.",
	},
	maid: {
		name: "메이드",
		desc: "당신을 하녀들의 일원으로 보이게 한다.",
		details: "정리정돈 기술의 성공률을 높여준다.",
	},
	chastity: {
		name: "정조대",
		desc: "당신의 순결을 지켜준다, 원하든 원하지 않든.",
		details: "당신의 성기를 잠궈서, 사용하지 못하게 한다.",
	},
	cage: {
		name: "우리",
		desc: "당신의 순결을 지켜준다, 원하든 원하지 않든.",
		details: "당신의 성기를 잠궈서, 사용하지 못하게 한다.",
	},
	hidden: {
		name: "숨겨짐",
		desc: "당신의 은밀한 부위를 은밀하게 해준다.",
		details: "누구도 당신이 어떤 종류의 성기를 가지고 있는지 볼 수 없게 한다.",
	},
	gag: {
		name: "재갈",
		desc: "당신의 입을 보호해 주지만, 또한 사용하지도 못하게 한다.",
		details: "키스, 삽입, 혀 공격에서 입을 보호해준다. 말을 할 수 없게 해준다.",
	},
	leash: {
		name: "목줄",
		desc: "당신을 여기저기 끌고 다니기에 편리한 손잡이.",
		details: "특정 이벤트들에서 사람들이 당신을 거칠게 끌고 다니게 해 준다.",
	},
	pushup: {
		name: "보정",
		desc: "가슴을 크게 보이게 한다.",
		details: "당신의 가슴을 두 단계 크게 보이게 한다.",
	},
	bellyHide: {
		name: "배 숨김",
		desc: "어느 정도까지, 임신한 배를 가려준다.",
		details: "none",
	},
	bellyShow: {
		name: "배 보임",
		desc: "당신의 배를 노출시킨다. 임신한 것을 더 명백하게 보여준다.",
		details: "none",
	},
	constricting: {
		name: "타이트함",
		desc: "임신이 어느 정도까지 진행되면 입을 수 없다.",
		details: "none",
	},
	bookbag: {
		name: "책가방",
		desc: "학교 교과서를 가지고 다니는 용도.",
		details: "수업 전에 공부할 수 있게 해 준다. 교과서와 관련된 부정적인 이벤트를 피할 수 있게 해 준다.",
	},
	waterproof: {
		name: "완전방수",
		desc: "수분이 스며나오지 않는다.",
		details: "수분이 옷에서 새어나오는 것을 막아준다.",
	},
	esoteric: {
		name: "비전",
		desc: "드러내지 못하는 것을 드러내 준다.",
		details: "당신의 성지식, 트라우마, 환각제 섭취에 관계없이 환각을 보게 해 준다.",
	},
	unstealthy: {
		name: "숨기 힘듬",
		desc: "더 숨기 어려워진다.",
		details: "도둑질에서 얻는 범죄의 양을 늘려준다.",
	},
};

setup.hairDetails = {
	loose: {
		desc: "얼굴 주위로 풀려 떨어져내린 머리모양. 자라면 길어진다.",
	},
	short: {
		desc: "머리카락이 길게 자랐다 하더라도, 정돈된 상태에서는 짧아 보이는 머리모양.",
	},
	curly: {
		desc: "곱슬곱슬한 머리모양.",
	},
	sleek: {
		desc: "반듯하게 뻗은 머리모양.",
	},
	textured: {
		desc: "아프로 질감의 머리모양.",
	},
	wavy: {
		desc: "그렇게 곱슬거리지도, 그렇게 반듯이 뻗지도 않은 머리모양.",
	},
	pigtails: {
		desc: "두 묶음의 머리가 머리의 양쪽에 달려있는 머리모양.",
	},
	buns: {
		desc: "머리카락이 감겨서 고정되어 있는 머리모양.",
	},
	braids: {
		desc: "머리카락 가닥이 서로 짜여진 머리모양. 레게머리처럼, 엄밀하게는 땋은머리가 아닌 스타일도 포함한다.",
	},
	ponytail: {
		desc: "머리 뒤쪽으로 모은 머리모양.",
	},
};
